{"posts":[{"title":"My 2025 Year in Review and Highlights ✨️","text":"IntroductionHello, 👋 I’m K4LM3D or Kal in some of you but my username in TORN is now Kalakal. I felt my previous username wasn’t suitable in Torn so I changed it. Anyway, on this post, I’ll share some of my 2025 journey and milestones. Quarter I: All NewThe year began with a push for rank, hitting Highly Distinguished in early January. Then after a year of service in Coursebound Armada [OJCW] faction, I got promoted from Navigator to First Officer. 🏴‍☠️ That was a big change for me because I wasn’t just assisting in our operations anymore, I’m also part of the council where I now have the power to vote on the faction’s plans. Aside form that, I became a spy for our leader, Inf3xshun. It just happened and we didn’t plan it. I’m not going to keep it a secret anymore because there’s no reason to hide it, but I won’t share any details of it. 😉 So, if need to spy on someone in-game, hire me! (Joke! I’m retired!) On the month of February, Inf3xshun sold our faction to slugginshipley, one of the council members, because of his health issues IRL. That same month, I reached level 40. Then, the day of March 20 come when I celebrated my 500th day of service in OJCW faction. That same day I changed my username. (BTW If you need an active faction, just DM me and I’ll recommend you to them.) Quarter II: The Tough TransitionFast forward on the month of Mayo, I’ve decided to focus on my real life commitments and stop playing games. It was a tough decision to make but I have to do it coz I don’t wanna burden other people both online and offline. After our failed ranked war, I said goodbye to them but when I’m about to click the leave button, I can’t do it so I asked Josy82, one of the council, to kick me instead. She kicked me out with this message: “Goodbye Kal,i hate to do this but you was asking,c u around.” I can’t describe that feeling. I’m happy yet it hurts. 😩 After that, of course I didn’t play anymore but I was still receiving messages from members of my old faction, and mails from players who wanted to recruit me into their faction/company. Then, I remembered koolet321, my former landlord who is actually Filipino and has an all-Filipino faction. (Hey, Filipinos! 🇵🇭) To stop receiving recruitment messages, my solution was to join an inactive faction. koolet321 said back then that their gang was inactive because they were busy with life, but I could still join. So I messaged her and joined Philippine Republic [PR]. (If you need to rent a Private Island, message her and mention me, she might give you a discount! 😗 Sorry. I’m promoting again 😅) Quarter III: Inactivity and LongevityI just visit Torn occationally after all of that, especially since I don’t always have data. But despite that, I was still promoted to Chief Justice in the PR faction and celebrated my two years in Torn. I also maxed out every job rank available in Torn City Jobs. (Turns out there was no merit for doing that. What a waste 😞) Quarter IV: Social ShiftWhen November came, Xythran and I planned to buy a PI and share it here. It started on September 14 when he found a Cesium-137 in the City worth more than 500 million. I proposed and we got married on Nov 18. We invited Khaelent as our witness, which he accepted after he landed sa airport 😆 (It’s just that he was the only one active at that time) and we vowed to share PI. But that time we haven;t have PI, so we shared my mansion for the meantime. The next day, I reached level 45, and I got a message from Josy82 congratulating us. 🥰 I was surprised and wondered how she found out, but I assumed Xythran told her because he already said goodbye since he was busy in real life and the twice-a-month ranked war in a very active faction was too much hassle. Xythran left OJCW on Dec 3 to transfer to PR. It took a while due to some issues, so he was able to buy PI on Dec 9. Then, just recently on Dec. 27, I finally got the Spinner honor. Out of all the awards, this is probably the one I’m most proud of. I mean, you have to spin the roulette wheel a thousand times. Within 2 weeks (1000 / 75 = 13.33), you can get it, but it’s a bit of a drag, so I wasn’t consistent. Lastly, just yesterday I won a Villa on the Wheel of Mediocrity and sold it for $1 million. 🤑 Achievements and MilestonesAcademic Achievements Bachelor of Self Defense: Completed on June 13, 2025. Bachelor of Sports Science: Completed on August 8, 2025. Bachelor of Psychological Sciences: Completed on November 11, 2025. Criminal Milestones Byte Boss: 10,000 Cybercrimes reached on December 9, 2025. Impeccable Imitator: 6,000 Counterfeiting offenses reached on December 19, 2025. Cinephile: Sold 10,000 DVDs of each movie genre in Bootleging on December 28, 2025 Thanks for reading! God bless","link":"/torn/2025-year-in-review-highlights/"},{"title":"I&#39;m So Close to My Degree","text":"As I sit down to write this, I can hardly believe how close I am to achieving a significant milestone in my life: earning a degree. Today, I started my 9th course under Computer Science education which is Algorithms And Advanced Programming. With just 147* days left and only 7 courses to complete, the finish line is finally in sight! Computer Science CMT1520 : Introduction To Computing (7 Days) CMT2230 : Web Design And Development (7 Days) CMT2530 : Intermediate Programming (14 Days) CMT2560 : Algorithms And Advanced Programming (21 Days) CMT2130 : Web Security And Penetration Testing (7 Days) [New] CMT2131 : Automated Data Mining &amp; Processing (14 Days) [New] CMT2540 : Networking (14 Days) CMT2610 : Computer Security And Defense (28 Days) CMT2550 : Computer Repair (14 Days) CMT2570 : Fundamentals Of Computer Architecture (14 Days) CMT2128 : Overclocking (7 Days) CMT2129 : Advanced Overclocking (7 Days) CMT2580 : Software Engineering (21 Days) CMT2590 : Quantum Computing (14 Days) CMT2600 : Natural Language Engineering (21 Days) CMT3620 : Bachelor Of Computer Science (49 Days) (currently taking) To see the courses I’ve taken, check my Course Checklist Actually, it should be less than that. A week ago, the curriculum changed. They added to two (2) more courses related to aiding the increase of email frauds (See Crimes 2.0: Scamming) which will take 21 days to finish. “Digital crime statistics provided by the Torn City Police Department have revealed that seven out of four people have been financially impacted by an online scam within the past month.”&mdash;sugarvalves, Torn City Times, on 27/08/24 See the article: Scamming On The Rise In Torn City Reflecting on this journey, I am filled with a mix of emotions&mdash;excitement, anticipation, and a touch of nostalgia. It feels like just yesterday that I was stepping onto campus for the first time, filled with dreams and uncertainties. Now, after countless late nights, projects, and moments of self-doubt, I can see the culmination of my hard work approaching. Each course I have taken has contributed to my growth, not just edcationally but personally as well. These skills will undoubtedly serve me well in the future, no matter where my career takes me. As I embark on these final courses, I am reminded of the importance of staying focused and motivated. It’s easy to feel overwhelmed with the end so close, but I am determined to finish strong. I plan to embrace every moment, and make the most of the resources available to me. * With no perks, there is a total of 147 days left to acquire Bachelor of Computer Science. Of course, it is different with perks. Actually, I spend 10 merits on Education Length which gives +10% education length reduction. Also, I'm promoted to the top rank of the job Education (Principal) which gives a passive +10% course time reduction. (See How to shorten Education time)","link":"/torn/close-to-my-degree/"},{"title":"My Course Checklist","text":"Although Torn is one of the most dangerous cities in the world, Education is still important. I can say that living here without proper education is a living hell. I bet everyone will agree with me on this! In this post, I will show you the list of courses I taken up, currently taking, and will be taking. Information in this post are frequently changed or updated so check this post again for updates Biology BIO1340 : Introduction To Biochemistry BIO2350 : Evolution BIO2360 : Intermediate Biochemistry BIO2370 : Advanced Biochemistry BIO2380 : Fundamentals Of Neurobiology BIO2390 : Chromosomes And Gene Functions BIO2400 : Forensic Science BIO2410 : Anatomy BIO2127 : Intravenous Therapy BIO3420 : Bachelor Of Biology+ Business BUS1100 : Introduction To Business BUS2200 : Statistics BUS2300 : Communication BUS2400 : Marketing* BUS2500 : Corporate Finance BUS2600 : Corporate Strategy BUS2700 : Pricing Strategy BUS2800 : Logistics BUS2900 : Product Management BUS2100 : Business Ethics BUS2110 : Human Resource Management BUS2120 : E-Commerce BUS3130 : Bachelor Of Commerce Combat Training CBT1780 : Introduction To Combat CBT2790 : Military Psychology CBT2800 : Study Of War And Technology* CBT2810 : Study Of Society And Warfare* CBT2820 : Study Of Machine Guns* CBT2830 : Study Of Submachine Guns* CBT2840 : Study Of Pistols CBT2850 : Study Of Rifles CBT2860 : Study Of Heavy Artillery* CBT2125 : Study Of Shotguns CBT3870 : Bachelor Of Military Arts And Science Computer Science CMT1520 : Introduction To Computing CMT2230 : Web Design And Development CMT2530 : Intermediate Programming CMT2560 : Algorithms And Advanced Programming CMT2130 : Web Security And Penetration Testing [New] CMT2131 : Automated Data Mining &amp; Processing [New] CMT2540 : Networking CMT2610 : Computer Security And Defense CMT2550 : Computer Repair CMT2570 : Fundamentals Of Computer Architecture CMT2128 : Overclocking CMT2129 : Advanced Overclocking CMT2580 : Software Engineering CMT2590 : Quantum Computing CMT2600 : Natural Language Engineering CMT3620 : Bachelor Of Computer Science General Studies GEN1112 : Introduction To General Studies GEN2113 : Driving License GEN2114 : Astronomy* GEN2115 : Mechanical Arts* GEN2116 : General Mechanics GEN2117 : Basic English GEN2118 : Creative Writing GEN2119 : General Science GEN2120 : Survival Skills GEN2122 : Newtonian Physics* GEN2123 : Ivory Crafting* GEN3121 : Bachelor Of General Studies+ Health &amp; Fitness HAF1103 : Introduction To Health And Fitness HAF2104 : Aerobics HAF2105 : Acrobatics HAF2106 : Power Lifting HAF2107 : Yoga HAF2108 : Swimming HAF2109 : Marathon Training HAF2110 : Sailing* HAF3111 : Bachelor Of Health Sciences History HIS1140 : Introduction To History HIS2150 : Aims &amp; Methods In Archaeology HIS2160 : Ancient Japanese History HIS2170 : Medieval History HIS2180 : Medieval Archaeology HIS2190 : South Asian Archaeology HIS2200 : Egyptian Archaeology HIS3210 : Bachelor Of History* (currently taking) Law LAW1880 : Introduction To Law LAW2890 : Public Law LAW2900 : Common Law LAW2910 : Property Law* LAW2920 : Criminal Law LAW2930 : Administrative Law LAW2940 : Commercial And Consumer Law* LAW2950 : Family Law* LAW2960 : Labor Law LAW2970 : Social And Economic Law LAW2980 : Use Of Force In International Law LAW2990 : International Human Rights LAW2100 : Media Law* LAW2101 : Revenue Law LAW3102 : Bachelor Of Law+ Mathematics MTH1220 : Introduction To Mathematics MTH2240 : Essential Foundation Mathematics MTH2250 : Intermediate Mathematics MTH2260 : Geometry MTH2320 : Geometry 2 MTH2270 : Algebra* MTH2280 : Probability MTH2290 : Trigonometry* MTH2300 : Calculus* MTH2310 : Discrete Mathematics MTH3330 : Bachelor Of Mathematics+ Psychology PSY1630 : Introduction To Psychology PSY2640 : Memory And Decision PSY2650 : Brain And Behaviour PSY2660 : Quantitative Methods In Psychology PSY2670 : Applied Decision Methods PSY2680 : Attention And Awareness PSY2132 Intrapersonal Dynamics [New] PSY3690 : Bachelor Of Psychological Sciences+ Self Defence DEF1700 : Introduction To Self Defense DEF2710 : Judo DEF2720 : Kick Boxing DEF2730 : Krav Maga DEF2740 : Jujitsu DEF2750 : Tae Kwon Do DEF2760 : Muay Thai DEF3770 : Bachelor Of Self Defense+ Sports Science SPT1430 : Introduction To Sports Science SPT2440 : Strength And Conditioning SPT2450 : Physiological Testing SPT2460 : Human Movement Analysis SPT2470 : Bio Mechanical Determinants Of Skill SPT2480 : Sports Medicine* SPT2490 : Nutritional Science SPT2500 : Analysis And Performance SPT2126 : Sports Administration SPT3510 : Bachelor Of Sports Science+ Last updated on 2024-08-29 *Course(s) that either I'm not taking or not in my priority to take first +Degree(s) I consider taking next","link":"/torn/course-checklist/"},{"title":"When I First Stepped on Torn City","text":"Ayo, K4LM3D right here. I’m just chilling here at my apartment while writing this. Nothing special, just wanna share my journey at one of the most dangerous cities, Torn City. 🏢 First day, first jobOn my first day, not gonna lie, I’m actually lost. It’s a big city, ya know?! I only heard of Torn City on advertisements and on the news. I came here to study and when I got here, the first thing I did was to find a job. I applied for the army but I failed my interview. Then, I applied to a grocery store and fortunately, I got in as a bagger for a salary of $200 a day. The next day, I quit my job and applied again in the army but this time, my interview was a success and I got the job. My salary is -$50 less compared on being a bagger but it’s fine. I still pressed on. 📚 Being a working studentFor my studies, I joined a Computer Science course. I took the first module, CMT1520: Introduction to Computing. I completed it within a week while I’m in the army. I want to continue the course but my job’s requiring me to be more physical so I change course. I joined a Self Defence course but I just wanna take the first module, DEF1700: Introduction to Self Defence. I don’t wanna learn martial arts or sports on the next modules so I change course again soon after I finished it. My next course is a Combat Training course. This time I want to finish it. It has 11 modules. After that, I will go back and finish my first course which is Computer Science. ⚒ My hard work finally payed offAlthough my salary is okay in the army, it’s not enough so in between my studies and work, I sell some stuff so that I can go to gym and buy new clothes. I also do a lot of missions for George. I met him in the city. It took me 13 days to finished all of that for more money. He is a good friend though. After 12 days in the army, I got a job offer from a Private Security Firm to be a Security Contractor. I’m so blessed because the salary is $50k a day. It’s way way more money compared to my daily salary on my previous jobs. I, actually, can’t believe it but I quit my job and after I got my first day salary at the firm, I’m super happy. I bought an apartment worth $25k and do some modifications in it&mdash;an upgrade worth $12.5k. Now, I only have to pay $25 daily for the upkeep. Oops! I still want to go on but I need to go to work now. ‘Till next time 👋","link":"/torn/first-step/"},{"title":"From Battlefield to Bazaar: My Journey as an Army General and Torn Tycoon","text":"Hi again! K4LM3D here. This is gonna be an update post. Again, thank you for passing by, thank you for reading my posts. Hope you’re doing well in your journey too! This post is still under construction. We're sorry. One of the most challenging aspects of Torn has been balancing my criminal pursuits with my legitimate business ventures. While the thrill of a successful heist or a lucrative drug deal is undeniably tempting, I’ve learned the importance of building a solid foundation through honest work. It’s a delicate dance between the dark side and the light, but I’ve managed to find a way to thrive in both worlds. Want to join the adventure?​If you’re a Torn player, feel free to drop by my bazaar and see what treasures await. And if you’re a seasoned professional looking for a new challenge, well, Torn might just be the virtual battlefield you’ve been searching for. See you there! ​P.S. Remember, just like in the real world, a little bit of military strategy can go a long way in Torn. So, salute your fellow players, stay vigilant, and most importantly, have fun!","link":"/torn/from-battlefield-to-bazaar/"},{"title":"I&#39;m Investing in the Stock Market","text":"Living independently is not easy. I’m studying while making money to support myself. Aside from my grades, I worry about paying the bills, what to eat and drink, cleaning the house, being healthy and productive, and making profit wherever I go. To be honest, I can’t believe I’m able survive everyday. Slowly but surely, I grind and grind to make millions of dollars. I studied about the Points Market and then, bought 25 points. I went to haitus for 46 days and then started to grind again. Yesterday, I withdrawed 3 million from Cayman Island’s Bank, returned home, and bought 60 points from the Points Market. I exchanged 50 points for a Stock Ticker and I studied about Torn City Stock Exchange. Then today, I bought 400,000+ worth of shares from West Side University. My goal is to buy 1 million shares. That is worth more than 93 million dollars. It gives +10% education course time reduction.","link":"/torn/investing-in-the-stock-market/"},{"title":"I Received Educational Support From Our Faction Leader","text":"I recently had the opportunity to chat with our faction leader, Inf3xshun [2836504]. We discussed about making money, doing business (buy and sell), and making profit through investments. Donator PackFeeling confident in my gameplay, I decided to invest in a donator pack. After consulting with Inf3xshun, I withdrew $20 million from our faction’s bank and $9 million from Caymans Island’s Bank. He believed that the donator pack would provide significant benefits and enhance my overall experience. Warring Other Factions: A Profitable StrategyShun also recommended warring other factions as a lucrative way to generate profits. While this strategy involves risks, he emphasized the potential rewards. Now, I’m more eager to contribute to our faction’s growth. Investment: Stock Market VenturesBeyond my usual activities, I’ve recently invested in West Side University’s stock market as I’ve shared on my previous post. This passive income stream aligns with my long-term goals and offers a diversified approach to my finances and education. A Surprising TwistJust when I thought I had a plan, Shun surprised me even further. He sent me a staggering $88 million to invest in West Side University’s stock market. His reasoning was simple: he wanted to contribute to my education and help me achieve the +10% education time reduction. Returning the FavorWhile I was initially hesitant to accept such a large sum, I realized that Inf3xshun’s generosity was genuine. I accepted the money, invested in WSU stocks, and returned the excess funds to him. His trust in me was humbling, and I was determined to make the most of this opportunity. Donator Pack and Faction ContributionsWith the funds I withdrew from CIB, I purchased a donator pack from the market. The perks were substantial, including 60 points and various other benefits. To show my gratitude to the faction, I also donated blood bags, medicines, and drugs. Looking AheadWhile my recent purchases have depleted my funds, I’m excited to see the benefits they bring. I’ll need to grind and make money to replenish my bank account, but I’m confident that my investments will pay off in the long run. My experience with our leader has been truly inspiring. His generosity and support have strengthened my commitment to our faction and motivated me to strive for greater achievements in Torn City. I’m grateful for the opportunities and challenges that this virtual world has presented, and I look forward to what the future holds. Thanks for your generosity, Leader Shun! This post was made with the help of Google Gemini, an AI assistant.","link":"/torn/received-educational-support/"},{"title":"As My Story at Torn City Goes On","text":"Hello again, citizens of Torn! If you’re reading this, I just want to say thank you for visiting my blog ^.^ It’s been awhile since my first post about my journey in Torn City, and a lot of things happened during those times I am away. In this post, we will be doing an update about my work, studies, and so on. If you haven’t read my previous post yet, I highly recommend that you read it first because there’s going to be a lot of references in that post. If you’ve already read it, then let’s go! 🤼 Join a faction and find new friendsLast year, on October 14, two days after I published my first Torn post, I received a message from Will. It says that they’re recruiting a bunch of people for their factions. It’s up to us if we join or not. If I join, I have to choose from a list of factions, and I chose Orange Chocolate Winter. You may ask why. It is because there are only two people in there at that time, and I want to start with only a few people in a group. Right now, we have 11 people in the faction (including me). They are such welcoming, understanding, and helpful people. And being in a faction is really a blessing because we have a faction bank where we can deposit money and stuff and withdraw or borrow from it. We also help each other during fights, wars, etc. When it comes to socializing, I am lacking. I don’t talk much most of the time, but when I get to talk, I talk too much. Usually, I listen more, I read more, and I observe more. I hope they don’t kick me out for that 😅 🏡 Upgraded livingRemember on my previous blog, I said that I was writing it in my apartment? Now, I’m writing this blog post about my mansion. That’s right! In my previous work, I’ve gotten a $50k salary daily. I kept 90% of it in my faction’s bank. Aside from that, I have also done different side jobs for George and an online business. I kept doing that until I could finally buy a mansion. It had a market price of $5 million+ and an upkeep of $500 daily. Inside it, there are a hot tub, a sauna, a large pool, and an open bar. I also spent $1.5 million on superior interior modifications. I live here alone. I didn’t hire staff yet, so I do the cooking, the cleaning, and all the household chores you can think of! Well, that’s part of being an independent individual, you know!? I have to get through this for now. My dream is to live on a private island someday with my partner (if there’s going to be one, but if there’s none, it’s fine), and by that time, maybe I can afford to hire staff. 💼 Same job, different companyToday, at Torn, is Employee Appreciation Day! Shoutouts to all the employees out there like me. I’m still working as a security contractor, but for a different firm. I had left Torn for awhile and didn’t show up on work because of personal reasons. My previous director fired me, but she left me a message saying that if ever I want to come back to work, I can just let her know. When I came back to Torn, I couldn’t contact her, so I applied to a bunch of firms. I work in the army as a major while waiting for a company to hire me. It took days before I got accepted to a firm with a daily salary of $500,000. That’s so much bigger than at my previous firm. 🎓 Courses and chaosIn my previous post, I mentioned that I was taking up a combat training course. When I finished that, I took a Web Design and Development course to open an online business. Then, the Strength and Conditioning course, the Biomechanical Determinants of Skill course, the Nutritional Science course, the Analysis and Performance course, and the Introduction to Biochemistry course. Right now, I’m taking an intravenous therapy course. It was a course recommended by our faction leader. He said it would help us so much in the war, so I took it up. That’s it for now, guys. That’s the update! I’m sorry it took so long. I’ll post again as soon as I possibly can. Thank you very much, guys!","link":"/torn/story-goes-on/"}],"tags":[{"name":"Education","slug":"education","link":"/torn/tags/education/"},{"name":"Travel","slug":"Travel","link":"/torn/tags/Travel/"},{"name":"Faction","slug":"Faction","link":"/torn/tags/Faction/"},{"name":"Marriage","slug":"Marriage","link":"/torn/tags/Marriage/"},{"name":"Property","slug":"Property","link":"/torn/tags/Property/"},{"name":"Crimes","slug":"Crimes","link":"/torn/tags/Crimes/"},{"name":"Stock Market","slug":"Stock-Market","link":"/torn/tags/Stock-Market/"},{"name":"Job","slug":"Job","link":"/torn/tags/Job/"}],"categories":[],"pages":[{"title":"404: Page Not Found","text":"It seems that the page you have requested does not exist or no longer exist. Go back to previous page &gt;","link":"/torn/404"},{"title":"Error 500","text":"Go back to previous page &gt;","link":"/torn/505"},{"title":"Torn","text":"Torn is a text-based online RPG set in Torn City, a dark, murky underworld where only the sharpest survive. In Torn City you can be anyone and do anything. Build your character to infinite strengths and play it your way. Torn is a massive multiplayer game with thousands of active players around the world. Join them, fight them, befriend them, marry them, gamble against them, trade with them, compete with them, war alongside them. Whatever you do - do it now! Notice: This is not sponsored but an act of appreciation to the games that makes me forget about reality for just a moment.","link":"/torn/Torn/index.html"},{"title":"About","text":"Welcome! My name is K4LM3D (/ka:md/) and this is my Torn blog. I write about my experience in there in a role player way. Thanks for stopping by. I will be posting more gaming related contents and experience here. Hope you stay tuned for updates. Edit (2026-01-03): I changed my in-game name/username to Kalakal. You can check my post about it here. Also, I changed this site description to Torn Diaries because Inf3xshun used that to refer to this.","link":"/torn/about/index.html"},{"title":"My Torn Goals","text":"Information in this post are frequently changed or updated so check this post again for updates To dos:(in-game) Crimes Bootlegging: Take CMT2230 Web Design and Development Bootlegging: Honor: Online Entreprenuer Bootlegging: Enhancer: High-Speed Drive Bootlegging: Skill lvl.50: Set up an online store Bootlegging: Skill lvl.100 Cracking: Skill lvl.50 Cracking: Honor: Character Assassination Buy all enhancers for crimes Cracking: Skill lvl.100 Education Computer Science: Finish the course Job Education: Position: Principal Job: Army: Position: General Apply to a Law Firm? (or make one?) Job: Law Back to a Private Security Firm? Last updated on 2024-11-20","link":"/torn/goals/index.html"}]}